datos.org
#+TITLE:     Manejo de datos con R
#+AUTHOR:    Oscar Perpiñán Lamigueiro
#+EMAIL:     oscar.perpinan@gmail.com
#+DATE:      25 de Enero de 2013
#+DESCRIPTION:
#+KEYWORDS:
#+LANGUAGE:  es
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT: view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+LINK_UP:   
#+LINK_HOME: 
#+XSLT:
#+startup: beamer
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [bigger]
#+BEAMER_FRAME_LEVEL: 3
#+LATEX_HEADER: \AtBeginSection[]{\begin{frame}<beamer>\frametitle{Contenidos}\tableofcontents[currentsection]\end{frame}}
#+LATEX_HEADER: \lstset{keywordstyle=\color{blue}, commentstyle=\color{gray!90}, basicstyle=\ttfamily\small, columns=fullflexible, breaklines=true,linewidth=\textwidth, backgroundcolor=\color{gray!23}, basewidth={0.5em,0.4em}, literate={á}{{\'a}}1 {ñ}{{\~n}}1 {é}{{\'e}}1 {ó}{{\'o}}1 {º}{{\textordmasculine}}1}
#+LATEX_HEADER: \usepackage{mathpazo}
#+LATEX_HEADER: \setbeamercovered{transparent}
#+LATEX_HEADER: \usefonttheme{serif} 
#+LATEX_HEADER: \usetheme{Goettingen}
#+PROPERTY:  tangle yes
#+PROPERTY:  comments org

* =read.table=
** Working directory
*** Movernos por los directorios
#+begin_src R
  getwd()
  old <- setwd("~/R/intro")
  dir()
  dir(pattern='.R')
  dir('data')
#+end_src

** Lectura de ficheros (sencillo)
*** Primer intento con SIAR
- [[http://eportal.magrama.gob.es/websiar]]
- Seleccionamos 01/01/2004 a 31/12/2011
- Temperatura, Humedad, Viento, Lluvia, Radiación, ET

*** Lectura de datos con =read.table=
- Primero lo intentamos con la versión final
#+begin_src R
  dats <- read.table('data/aranjuez.csv')
  head(dats)
  
  dats <- read.table('data/aranjuez.csv', sep=',')
  head(dats)
  
  dats <- read.table('data/aranjuez.csv', sep=',', header=TRUE)
  head(dats)
  
  aranjuez <- read.csv('data/aranjuez.csv')
  head(aranjuez)
  
  class(aranjuez)
  names(aranjuez)
#+end_src

*** Visualización de datos 
#+begin_src R 
  library(lattice)
  xyplot(Radiation ~ TempAvg, data=aranjuez)
  
  xyplot(Radiation ~ TempAvg, data=aranjuez,
         type=c('p', 'r'))
  
  xyplot(Radiation ~ TempAvg + TempMax + TempMin,
         data = aranjuez, xlab='Temperature',
         type=c('p', 'r'), auto.key=TRUE,
         pch=16, alpha=0.5)
#+end_src

*** Transformamos a serie temporal

#+begin_src R
  library(zoo)
  
  fecha <- as.POSIXct(aranjuez[,1], format='%Y-%m-%d')
  head(fecha)
  
  aranjuez <- zoo(aranjuez[, -1], fecha)
  class(aranjuez)
  head(aranjuez)
#+end_src

*** Leemos directamente como serie temporal
#+begin_src R
  aranjuez <- read.zoo('data/aranjuez.csv', sep=',', header=TRUE)
#+end_src

#+begin_src R
header(aranjuez)
names(aranjuez)
summary(index(aranjuez))
#+end_src

** Lectura de datos (real)
*** Ahora probamos con la versión original
- Primero descomprimimos en una carpeta temporal
#+begin_src R
  unzip('data/InformeDatos.zip', exdir='data')
#+end_src
- Y ahora abrimos teniendo en cuenta codificación, separadores, etc.
#+begin_src R
  aranjuez <- read.table("data/M03_Aranjuez_01_01_2004_31_12_2011.csv",
                       fileEncoding = 'UTF-16LE',
                       header = TRUE, fill = TRUE,
                       sep = ';', dec = ",")
  
  head(aranjuez)
  summary(aranjuez)
  names(aranjuez)
#+end_src
- Vemos el contenido
#+begin_src R
  summary(aranjuez)
#+end_src

*** Convertimos a serie temporal
#+begin_src R
  tt <- as.Date(aranjuez$Fecha, format='%d/%m/%Y')
  aranjuez <- zoo(aranjuez[, c(6, 7, 9, 11, 12, 16, 17, 19, 20, 22)],
                  order.by=tt)
#+end_src

*** Ajustamos los nombres (opcional)
#+begin_src R
  names(aranjuez) <- c('TempAvg', 'TempMax', 'TempMin',
                       'HumidAvg', 'HumidMax',
                       'WindAvg', 'WindMax',
                       'Radiation', 'Rain', 'ET')
#+end_src

