datos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="es" xml:lang="es">
<head>
<title>Manejo de datos con R</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Manejo de datos con R"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="25 de Enero de 2013"/>
<meta name="author" content="Oscar Perpiñán Lamigueiro"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Manejo de datos con R</h1>


<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <code>read.table</code></h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Working directory</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Movernos por los directorios</h4>
<div class="outline-text-4" id="text-1-1-1">




<pre class="example">getwd()
old &lt;- setwd("~/R/intro")
dir()
dir(pattern='.R')
dir('data')
</pre>


</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Lectura de ficheros (sencillo)</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Primer intento con SIAR</h4>
<div class="outline-text-4" id="text-1-2-1">

<ul>
<li><a href="http://eportal.magrama.gob.es/websiar">http://eportal.magrama.gob.es/websiar</a>
</li>
<li>Seleccionamos 01/01/2004 a 31/12/2011
</li>
<li>Temperatura, Humedad, Viento, Lluvia, Radiación, ET
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Lectura de datos con <code>read.table</code></h4>
<div class="outline-text-4" id="text-1-2-2">

<ul>
<li>Primero lo intentamos con la versión final
</li>
</ul>




<pre class="example">dats &lt;- read.table('data/aranjuez.csv')
head(dats)

dats &lt;- read.table('data/aranjuez.csv', sep=',')
head(dats)

dats &lt;- read.table('data/aranjuez.csv', sep=',', header=TRUE)
head(dats)

aranjuez &lt;- read.csv('data/aranjuez.csv')
head(aranjuez)

class(aranjuez)
names(aranjuez)
</pre>


</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Visualización de datos</h4>
<div class="outline-text-4" id="text-1-2-3">




<pre class="example">library(lattice)
xyplot(Radiation ~ TempAvg, data=aranjuez)

xyplot(Radiation ~ TempAvg, data=aranjuez,
       type=c('p', 'r'))

xyplot(Radiation ~ TempAvg + TempMax + TempMin,
       data = aranjuez, xlab='Temperature',
       type=c('p', 'r'), auto.key=TRUE,
       pch=16, alpha=0.5)
</pre>


</div>

</div>

<div id="outline-container-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Transformamos a serie temporal</h4>
<div class="outline-text-4" id="text-1-2-4">





<pre class="example">library(zoo)

fecha &lt;- as.POSIXct(aranjuez[,1], format='%Y-%m-%d')
head(fecha)

aranjuez &lt;- zoo(aranjuez[, -1], fecha)
class(aranjuez)
head(aranjuez)
</pre>


</div>

</div>

<div id="outline-container-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> Leemos directamente como serie temporal</h4>
<div class="outline-text-4" id="text-1-2-5">




<pre class="example">aranjuez &lt;- read.zoo('data/aranjuez.csv', sep=',', header=TRUE)
</pre>



<pre class="example">header(aranjuez)
names(aranjuez)
summary(index(aranjuez))
</pre>


</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Lectura de datos (real)</h3>
<div class="outline-text-3" id="text-1-3">


</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Ahora probamos con la versión original</h4>
<div class="outline-text-4" id="text-1-3-1">

<ul>
<li>Primero descomprimimos en una carpeta temporal
</li>
</ul>




<pre class="example">unzip('data/InformeDatos.zip', exdir='data')
</pre>

<ul>
<li>Y ahora abrimos teniendo en cuenta codificación, separadores, etc.
</li>
</ul>




<pre class="example">aranjuez &lt;- read.table("data/M03_Aranjuez_01_01_2004_31_12_2011.csv",
                     fileEncoding = 'UTF-16LE',
                     header = TRUE, fill = TRUE,
                     sep = ';', dec = ",")

head(aranjuez)
summary(aranjuez)
names(aranjuez)
</pre>

<ul>
<li>Vemos el contenido
</li>
</ul>




<pre class="example">summary(aranjuez)
</pre>


</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Convertimos a serie temporal</h4>
<div class="outline-text-4" id="text-1-3-2">




<pre class="example">tt &lt;- as.Date(aranjuez$Fecha, format='%d/%m/%Y')
aranjuez &lt;- zoo(aranjuez[, c(6, 7, 9, 11, 12, 16, 17, 19, 20, 22)],
                order.by=tt)
</pre>


</div>

</div>

<div id="outline-container-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> Ajustamos los nombres (opcional)</h4>
<div class="outline-text-4" id="text-1-3-3">




<pre class="example">names(aranjuez) &lt;- c('TempAvg', 'TempMax', 'TempMin',
                     'HumidAvg', 'HumidMax',
                     'WindAvg', 'WindMax',
                     'Radiation', 'Rain', 'ET')
</pre>


</div>

</div>
