datos.tex
% Created 2013-02-05 mar 14:55
\documentclass[bigger]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage{color}
\usepackage{listings}
\AtBeginSection[]{\begin{frame}<beamer>\frametitle{Contenidos}\tableofcontents[currentsection]\end{frame}}
\lstset{keywordstyle=\color{blue}, commentstyle=\color{gray!90}, basicstyle=\ttfamily\small, columns=fullflexible, breaklines=true,linewidth=\textwidth, backgroundcolor=\color{gray!23}, basewidth={0.5em,0.4em}, literate={á}{{\'a}}1 {ñ}{{\~n}}1 {é}{{\'e}}1 {ó}{{\'o}}1 {º}{{\textordmasculine}}1}
\usepackage{mathpazo}
\setbeamercovered{transparent}
\usefonttheme{serif} 
\usetheme{Goettingen}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Manejo de datos con R}
\author{Oscar Perpiñán Lamigueiro}
\date{25 de Enero de 2013}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs Org-mode version 7.8.11}}

\begin{document}

\maketitle


\section{\texttt{read.table}}
\label{sec-1}
\subsection{Working directory}
\label{sec-1-1}
\begin{frame}[fragile]
\frametitle{Movernos por los directorios}
\label{sec-1-1-1}


\lstset{language=R}
\begin{lstlisting}
getwd()
old <- setwd("~/R/intro")
dir()
dir(pattern='.R')
dir('data')
\end{lstlisting}
\end{frame}
\subsection{Lectura de ficheros (sencillo)}
\label{sec-1-2}
\begin{frame}
\frametitle{Primer intento con SIAR}
\label{sec-1-2-1}

\begin{itemize}
\item \url{http://eportal.magrama.gob.es/websiar}
\item Seleccionamos 01/01/2004 a 31/12/2011
\item Temperatura, Humedad, Viento, Lluvia, Radiación, ET
\end{itemize}
\end{frame}
\begin{frame}[fragile]
\frametitle{Lectura de datos con \texttt{read.table}}
\label{sec-1-2-2}

\begin{itemize}
\item Primero lo intentamos con la versión final
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
dats <- read.table('data/aranjuez.csv')
head(dats)

dats <- read.table('data/aranjuez.csv', sep=',')
head(dats)

dats <- read.table('data/aranjuez.csv', sep=',', header=TRUE)
head(dats)

aranjuez <- read.csv('data/aranjuez.csv')
head(aranjuez)

class(aranjuez)
names(aranjuez)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Visualización de datos}
\label{sec-1-2-3}


\lstset{language=R}
\begin{lstlisting}
library(lattice)
xyplot(Radiation ~ TempAvg, data=aranjuez)

xyplot(Radiation ~ TempAvg, data=aranjuez,
       type=c('p', 'r'))

xyplot(Radiation ~ TempAvg + TempMax + TempMin,
       data = aranjuez, xlab='Temperature',
       type=c('p', 'r'), auto.key=TRUE,
       pch=16, alpha=0.5)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Transformamos a serie temporal}
\label{sec-1-2-4}



\lstset{language=R}
\begin{lstlisting}
library(zoo)

fecha <- as.POSIXct(aranjuez[,1], format='%Y-%m-%d')
head(fecha)

aranjuez <- zoo(aranjuez[, -1], fecha)
class(aranjuez)
head(aranjuez)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Leemos directamente como serie temporal}
\label{sec-1-2-5}


\lstset{language=R}
\begin{lstlisting}
aranjuez <- read.zoo('data/aranjuez.csv', sep=',', header=TRUE)
\end{lstlisting}


\lstset{language=R}
\begin{lstlisting}
header(aranjuez)
names(aranjuez)
summary(index(aranjuez))
\end{lstlisting}
\end{frame}
\subsection{Lectura de datos (real)}
\label{sec-1-3}
\begin{frame}[fragile]
\frametitle{Ahora probamos con la versión original}
\label{sec-1-3-1}

\begin{itemize}
\item Primero descomprimimos en una carpeta temporal
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
unzip('data/InformeDatos.zip', exdir='data')
\end{lstlisting}
\begin{itemize}
\item Y ahora abrimos teniendo en cuenta codificación, separadores, etc.
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
aranjuez <- read.table("data/M03_Aranjuez_01_01_2004_31_12_2011.csv",
                     fileEncoding = 'UTF-16LE',
                     header = TRUE, fill = TRUE,
                     sep = ';', dec = ",")

head(aranjuez)
summary(aranjuez)
names(aranjuez)
\end{lstlisting}
\begin{itemize}
\item Vemos el contenido
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
summary(aranjuez)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Convertimos a serie temporal}
\label{sec-1-3-2}


\lstset{language=R}
\begin{lstlisting}
tt <- as.Date(aranjuez$Fecha, format='%d/%m/%Y')
aranjuez <- zoo(aranjuez[, c(6, 7, 9, 11, 12, 16, 17, 19, 20, 22)],
                order.by=tt)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Ajustamos los nombres (opcional)}
\label{sec-1-3-3}


\lstset{language=R}
\begin{lstlisting}
names(aranjuez) <- c('TempAvg', 'TempMax', 'TempMin',
                     'HumidAvg', 'HumidMax',
                     'WindAvg', 'WindMax',
                     'Radiation', 'Rain', 'ET')
\end{lstlisting}
\end{frame}
