datos.org
*** Nuevamente mostramos datos
- Método simple
#+begin_src R
  xyplot(aranjuez)
#+end_src
- Seleccionamos variables y superponemos
#+begin_src R
xyplot(aranjuez[,c("TempAvg", "TempMax", "TempMin")],
       superpose=TRUE)
#+end_src
- Para cruzar variables hay que convertir a =data.frame=
#+begin_src R
xyplot(TempAvg ~ Radiation, data=as.data.frame(aranjuez))
#+end_src

*** Limpieza de datos
- Conversión de Unidades (MJ -> Wh)
#+begin_src R
  aranjuez$G0 <- aranjuez$Radiation/3.6*1000
  xyplot(aranjuez$G0)
#+end_src
- Filtrado de datos
#+begin_src R
  aranjuezClean <- within(as.data.frame(aranjuez),{
    TempMin[TempMin>40] <- NA
    HumidMax[HumidMax>100] <- NA
    WindAvg[WindAvg>10] <- NA
    WindMax[WindMax>10] <- NA
  })
  
  aranjuez <- zoo(aranjuezClean, index(aranjuez))
#+end_src

* Datos agregados
** =aggregate=
*** Media anual
- Primero definimos una función para extraer el año
#+begin_src R
  Year <- function(x)as.numeric(format(x, "%Y"))
  
  Year(index(aranjuez))
  
#+end_src
- Y la empleamos para agrupar con =aggregate=
#+begin_src R
  aranjuezY <- aggregate(aranjuez$G0, by=Year, FUN=mean, na.rm=TRUE)
  aranjuezY
  class(aranjuezY)
#+end_src

#+begin_src R
G0y <- aggregate(aranjuez$G0, by=Year, FUN=mean, na.rm=TRUE)
G0y
#+end_src
*** Medias mensuales
- Meses como números
#+begin_src R
  Month <- function(x)as.numeric(format(x, "%m"))
  
  Month(index(aranjuez))
#+end_src

#+begin_src R
  G0m <- aggregate(aranjuez$G0, by=Month, FUN=mean, na.rm=TRUE)
  G0m
#+end_src

- Meses como etiquetas
#+begin_src R
months(index(aranjuez))
#+end_src

#+begin_src R
  G0m <- aggregate(aranjuez$G0, by=months, FUN=mean, na.rm=TRUE)
  G0m
#+end_src

*** Medias mensuales para cada año
- La función para agrupar es =as.yearmon=
#+begin_src R
  as.yearmon(index(aranjuez))
#+end_src

#+begin_src R
  G0ym <- aggregate(aranjuez$G0, by=as.yearmon, FUN=mean, na.rm=TRUE)
  G0ym
#+end_src


##################################################################
## Datos desde una URL
##################################################################
* Datos desde una URL
** NREL
*** Ejemplo: Lanai-Hawaii

#+begin_src R
  URL <- "http://www.nrel.gov/midc/apps/plot.pl?site=LANAI&start=20090722&edy=19&emo=11&eyr=2010&zenloc=19&year=2010&month=11&day=1&endyear=2010&endmonth=11&endday=19&time=1&inst=3&inst=4&inst=5&inst=10&type=data&first=3&math=0&second=-1&value=0.0&global=-1&direct=-1&diffuse=-1&user=0&axis=1"
  ## URL <- "data/NREL-Hawaii.csv"
#+end_src

#+begin_verbatim
DATE,HST,Global Horizontal [W/m^2],Direct Normal [W/m^2],Diffuse Horizontal [W/m^2],Air Temperature [deg C]
11/1/2010,06:32,4.87621,0,4.87621,14.67
11/1/2010,06:33,5.14142,0,5.14142,14.54
11/1/2010,06:34,1.42216,0,1.42216,14.43
11/1/2010,06:35,1.95135,0,1.95135,14.4
11/1/2010,06:36,2.44687,0,2.44687,14.55
11/1/2010,06:37,3.16990,0,3.16990,14.95
11/1/2010,06:38,3.99677,0,3.99677,15.45
11/1/2010,06:39,4.88811,0,4.88811,15.71
11/1/2010,06:40,5.85428,0,5.85428,15.8
11/1/2010,06:41,8.27598,0,8.27598,15.87
#+end_verbatim

*** Leemos como serie temporal
- Leemos con =read.zoo=
#+begin_src R
  lat <- 20.77
  lon <- -156.9339
  hawaii <- read.zoo(URL,
                  col.names = c("date", "hour", "G0", "B", "D0", "Ta"),
                  ## Dia en columna 1, Hora en columna 2
                  index = list(1, 2),
                  ## Obtiene índice temporal de estas dos columnas
                  FUN = function(d, h) as.POSIXct(paste(d, h),
                    format = "%m/%d/%Y %H:%M", tz = "HST"), 
                  header=TRUE, sep=",")
  
#+end_src
- Añadimos Directa en el plano Horizontal
#+begin_src R
  hawaii$B0 <- with(hawaii, G0-D0)
#+end_src

*** Mostramos datos como serie temporal
#+begin_src R
  xyplot(hawaii)
  xyplot(hawaii[,c('G0', 'D0', 'B0')], superpose=TRUE)
#+end_src

