datos.html

<div id="outline-container-1-3-4" class="outline-4">
<h4 id="sec-1-3-4"><span class="section-number-4">1.3.4</span> Nuevamente mostramos datos</h4>
<div class="outline-text-4" id="text-1-3-4">

<ul>
<li>Método simple
</li>
</ul>




<pre class="example">xyplot(aranjuez)
</pre>

<ul>
<li>Seleccionamos variables y superponemos
</li>
</ul>




<pre class="example">xyplot(aranjuez[,c("TempAvg", "TempMax", "TempMin")],
       superpose=TRUE)
</pre>

<ul>
<li>Para cruzar variables hay que convertir a <code>data.frame</code>
</li>
</ul>




<pre class="example">xyplot(TempAvg ~ Radiation, data=as.data.frame(aranjuez))
</pre>


</div>

</div>

<div id="outline-container-1-3-5" class="outline-4">
<h4 id="sec-1-3-5"><span class="section-number-4">1.3.5</span> Limpieza de datos</h4>
<div class="outline-text-4" id="text-1-3-5">

<ul>
<li>Conversión de Unidades (MJ -&gt; Wh)
</li>
</ul>




<pre class="example">aranjuez$G0 &lt;- aranjuez$Radiation/3.6*1000
xyplot(aranjuez$G0)
</pre>

<ul>
<li>Filtrado de datos
</li>
</ul>




<pre class="example">aranjuezClean &lt;- within(as.data.frame(aranjuez),{
  TempMin[TempMin&gt;40] &lt;- NA
  HumidMax[HumidMax&gt;100] &lt;- NA
  WindAvg[WindAvg&gt;10] &lt;- NA
  WindMax[WindMax&gt;10] &lt;- NA
})

aranjuez &lt;- zoo(aranjuezClean, index(aranjuez))
</pre>


</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Datos agregados</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <code>aggregate</code></h3>
<div class="outline-text-3" id="text-2-1">


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Media anual</h4>
<div class="outline-text-4" id="text-2-1-1">

<ul>
<li>Primero definimos una función para extraer el año
</li>
</ul>




<pre class="example">Year &lt;- function(x)as.numeric(format(x, "%Y"))

Year(index(aranjuez))

</pre>

<ul>
<li>Y la empleamos para agrupar con <code>aggregate</code>
</li>
</ul>




<pre class="example">aranjuezY &lt;- aggregate(aranjuez$G0, by=Year, FUN=mean, na.rm=TRUE)
aranjuezY
class(aranjuezY)
</pre>



<pre class="example">G0y &lt;- aggregate(aranjuez$G0, by=Year, FUN=mean, na.rm=TRUE)
G0y
</pre>

</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Medias mensuales</h4>
<div class="outline-text-4" id="text-2-1-2">

<ul>
<li>Meses como números
</li>
</ul>




<pre class="example">Month &lt;- function(x)as.numeric(format(x, "%m"))

Month(index(aranjuez))
</pre>



<pre class="example">G0m &lt;- aggregate(aranjuez$G0, by=Month, FUN=mean, na.rm=TRUE)
G0m
</pre>


<ul>
<li>Meses como etiquetas
</li>
</ul>




<pre class="example">months(index(aranjuez))
</pre>



<pre class="example">G0m &lt;- aggregate(aranjuez$G0, by=months, FUN=mean, na.rm=TRUE)
G0m
</pre>


</div>

</div>

<div id="outline-container-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> Medias mensuales para cada año</h4>
<div class="outline-text-4" id="text-2-1-3">

<ul>
<li>La función para agrupar es <code>as.yearmon</code>
</li>
</ul>




<pre class="example">as.yearmon(index(aranjuez))
</pre>



<pre class="example">G0ym &lt;- aggregate(aranjuez$G0, by=as.yearmon, FUN=mean, na.rm=TRUE)
G0ym
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Datos desde una URL</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> NREL</h3>
<div class="outline-text-3" id="text-3-1">


</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Ejemplo: Lanai-Hawaii</h4>
<div class="outline-text-4" id="text-3-1-1">





<pre class="example">URL &lt;- "http://www.nrel.gov/midc/apps/plot.pl?site=LANAI&amp;start=20090722&amp;edy=19&amp;emo=11&amp;eyr=2010&amp;zenloc=19&amp;year=2010&amp;month=11&amp;day=1&amp;endyear=2010&amp;endmonth=11&amp;endday=19&amp;time=1&amp;inst=3&amp;inst=4&amp;inst=5&amp;inst=10&amp;type=data&amp;first=3&amp;math=0&amp;second=-1&amp;value=0.0&amp;global=-1&amp;direct=-1&amp;diffuse=-1&amp;user=0&amp;axis=1"
## URL &lt;- "data/NREL-Hawaii.csv"
</pre>


<p>
DATE,HST,Global Horizontal [W/m<sup>2]</sup>,Direct Normal [W/m<sup>2]</sup>,Diffuse Horizontal [W/m<sup>2]</sup>,Air Temperature [deg C]
11/1/2010,06:32,4.87621,0,4.87621,14.67
11/1/2010,06:33,5.14142,0,5.14142,14.54
11/1/2010,06:34,1.42216,0,1.42216,14.43
11/1/2010,06:35,1.95135,0,1.95135,14.4
11/1/2010,06:36,2.44687,0,2.44687,14.55
11/1/2010,06:37,3.16990,0,3.16990,14.95
11/1/2010,06:38,3.99677,0,3.99677,15.45
11/1/2010,06:39,4.88811,0,4.88811,15.71
11/1/2010,06:40,5.85428,0,5.85428,15.8
11/1/2010,06:41,8.27598,0,8.27598,15.87
</p>
</div>

</div>

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Leemos como serie temporal</h4>
<div class="outline-text-4" id="text-3-1-2">

<ul>
<li>Leemos con <code>read.zoo</code>
</li>
</ul>




<pre class="example">lat &lt;- 20.77
lon &lt;- -156.9339
hawaii &lt;- read.zoo(URL,
                col.names = c("date", "hour", "G0", "B", "D0", "Ta"),
                ## Dia en columna 1, Hora en columna 2
                index = list(1, 2),
                ## Obtiene índice temporal de estas dos columnas
                FUN = function(d, h) as.POSIXct(paste(d, h),
                  format = "%m/%d/%Y %H:%M", tz = "HST"), 
                header=TRUE, sep=",")

</pre>

<ul>
<li>Añadimos Directa en el plano Horizontal
</li>
</ul>




<pre class="example">hawaii$B0 &lt;- with(hawaii, G0-D0)
</pre>


</div>

</div>

<div id="outline-container-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> Mostramos datos como serie temporal</h4>
<div class="outline-text-4" id="text-3-1-3">




<pre class="example">xyplot(hawaii)
xyplot(hawaii[,c('G0', 'D0', 'B0')], superpose=TRUE)
</pre>


</div>

</div>
