datos.tex
\begin{frame}[fragile]
\frametitle{Nuevamente mostramos datos}
\label{sec-1-3-4}

\begin{itemize}
\item Método simple
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
xyplot(aranjuez)
\end{lstlisting}
\begin{itemize}
\item Seleccionamos variables y superponemos
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
xyplot(aranjuez[,c("TempAvg", "TempMax", "TempMin")],
       superpose=TRUE)
\end{lstlisting}
\begin{itemize}
\item Para cruzar variables hay que convertir a \texttt{data.frame}
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
xyplot(TempAvg ~ Radiation, data=as.data.frame(aranjuez))
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Limpieza de datos}
\label{sec-1-3-5}

\begin{itemize}
\item Conversión de Unidades (MJ -> Wh)
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
aranjuez$G0 <- aranjuez$Radiation/3.6*1000
xyplot(aranjuez$G0)
\end{lstlisting}
\begin{itemize}
\item Filtrado de datos
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
aranjuezClean <- within(as.data.frame(aranjuez),{
  TempMin[TempMin>40] <- NA
  HumidMax[HumidMax>100] <- NA
  WindAvg[WindAvg>10] <- NA
  WindMax[WindMax>10] <- NA
})

aranjuez <- zoo(aranjuezClean, index(aranjuez))
\end{lstlisting}
\end{frame}
\section{Datos agregados}
\label{sec-2}
\subsection{\texttt{aggregate}}
\label{sec-2-1}
\begin{frame}[fragile]
\frametitle{Media anual}
\label{sec-2-1-1}

\begin{itemize}
\item Primero definimos una función para extraer el año
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
Year <- function(x)as.numeric(format(x, "%Y"))

Year(index(aranjuez))
\end{lstlisting}
\begin{itemize}
\item Y la empleamos para agrupar con \texttt{aggregate}
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
aranjuezY <- aggregate(aranjuez$G0, by=Year, FUN=mean, na.rm=TRUE)
aranjuezY
class(aranjuezY)
\end{lstlisting}


\lstset{language=R}
\begin{lstlisting}
G0y <- aggregate(aranjuez$G0, by=Year, FUN=mean, na.rm=TRUE)
G0y
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Medias mensuales}
\label{sec-2-1-2}

\begin{itemize}
\item Meses como números
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
Month <- function(x)as.numeric(format(x, "%m"))

Month(index(aranjuez))
\end{lstlisting}


\lstset{language=R}
\begin{lstlisting}
G0m <- aggregate(aranjuez$G0, by=Month, FUN=mean, na.rm=TRUE)
G0m
\end{lstlisting}

\begin{itemize}
\item Meses como etiquetas
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
months(index(aranjuez))
\end{lstlisting}


\lstset{language=R}
\begin{lstlisting}
G0m <- aggregate(aranjuez$G0, by=months, FUN=mean, na.rm=TRUE)
G0m
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Medias mensuales para cada año}
\label{sec-2-1-3}

\begin{itemize}
\item La función para agrupar es \texttt{as.yearmon}
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
as.yearmon(index(aranjuez))
\end{lstlisting}


\lstset{language=R}
\begin{lstlisting}
G0ym <- aggregate(aranjuez$G0, by=as.yearmon, FUN=mean, na.rm=TRUE)
G0ym
\end{lstlisting}
\end{frame}
\section{Datos desde una URL}
\label{sec-3}
\subsection{NREL}
\label{sec-3-1}
\begin{frame}[fragile]
\frametitle{Ejemplo: Lanai-Hawaii}
\label{sec-3-1-1}



\lstset{language=R}
\begin{lstlisting}
URL <- "http://www.nrel.gov/midc/apps/plot.pl?site=LANAI&start=20090722&edy=19&emo=11&eyr=2010&zenloc=19&year=2010&month=11&day=1&endyear=2010&endmonth=11&endday=19&time=1&inst=3&inst=4&inst=5&inst=10&type=data&first=3&math=0&second=-1&value=0.0&global=-1&direct=-1&diffuse=-1&user=0&axis=1"
## URL <- "data/NREL-Hawaii.csv"
\end{lstlisting}

DATE,HST,Global Horizontal [W/m$^2$],Direct Normal [W/m$^2$],Diffuse Horizontal [W/m$^2$],Air Temperature [deg C]
11/1/2010,06:32,4.87621,0,4.87621,14.67
11/1/2010,06:33,5.14142,0,5.14142,14.54
11/1/2010,06:34,1.42216,0,1.42216,14.43
11/1/2010,06:35,1.95135,0,1.95135,14.4
11/1/2010,06:36,2.44687,0,2.44687,14.55
11/1/2010,06:37,3.16990,0,3.16990,14.95
11/1/2010,06:38,3.99677,0,3.99677,15.45
11/1/2010,06:39,4.88811,0,4.88811,15.71
11/1/2010,06:40,5.85428,0,5.85428,15.8
11/1/2010,06:41,8.27598,0,8.27598,15.87
\end{frame}
\begin{frame}[fragile]
\frametitle{Leemos como serie temporal}
\label{sec-3-1-2}

\begin{itemize}
\item Leemos con \texttt{read.zoo}
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
lat <- 20.77
lon <- -156.9339
hawaii <- read.zoo(URL,
                col.names = c("date", "hour", "G0", "B", "D0", "Ta"),
                ## Dia en columna 1, Hora en columna 2
                index = list(1, 2),
                ## Obtiene índice temporal de estas dos columnas
                FUN = function(d, h) as.POSIXct(paste(d, h),
                  format = "%m/%d/%Y %H:%M", tz = "HST"), 
                header=TRUE, sep=",")
\end{lstlisting}
\begin{itemize}
\item Añadimos Directa en el plano Horizontal
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
hawaii$B0 <- with(hawaii, G0-D0)
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Mostramos datos como serie temporal}
\label{sec-3-1-3}


\lstset{language=R}
\begin{lstlisting}
xyplot(hawaii)
xyplot(hawaii[,c('G0', 'D0', 'B0')], superpose=TRUE)
\end{lstlisting}
\end{frame}
