datos.org
*** Mostramos relaciones entre variables
#+begin_src R
  xyplot(Ta ~ G0 + D0 + B0, data=as.data.frame(hawaii), type=c('p', 'smooth'),
         par.settings=custom.theme(alpha=.5, pch=16,
           lwd=3, col.line='black'),
         outer=TRUE, layout=c(3, 1),
         scales=list(x=list(relation='free')))
#+end_src

** Datos agregados
*** Irradiación horaria
- Primer intento
#+begin_src R
  hour <- function(x)as.numeric(format(x, '%H'))
#+end_src

#+begin_src R
  G0h <- aggregate(hawaii$G0, by=hour, FUN=sum, na.rm=1)/1000
  G0h
#+end_src

*** Irradiación horaria

#+begin_src R
  hour <- function(x)as.POSIXct(format(x, '%Y-%m-%d %H:00:00'))
#+end_src

#+begin_src R
  G0h <- aggregate(hawaii$G0, by=hour, FUN=sum, na.rm=1)/60
  G0h
#+end_src

*** Irradiación diaria
- A partir de la horaria
#+begin_src R
G0d <- aggregate(G0h, by=function(x)format(x, '%Y-%m-%d'), sum)/1000
#+end_src
- A partir de la minutaria
#+begin_src R
  G0d <- aggregate(hawaii$G0, by=function(x)format(x, '%Y-%m-%d'), sum)/60/1000
#+end_src


*** Más complicado: agrupar por 30 minutos
#+begin_src R
  halfHour <- function(tt, delta=30){
    tt <- as.POSIXlt(tt)
    gg <- tt$min %/% delta
    tt <- modifyList(tt, list(min=gg*delta))
    as.POSIXct(tt)
  }
#+end_src

#+begin_src R
  hawaii30 <- aggregate(hawaii, by=halfHour, FUN=sum)/60
  
  head(hawaii30)
#+end_src


########################################
## Una estación completa
## http://procomun.wordpress.com/2012/10/31/aemet-web-scraping-con-r/
########################################
# arenosillo <- read.csv2('data/El.Arenosillo.txt')
# tt <- as.POSIXct(arenosillo$Index)
# arenosillo <- zoo(arenosillo[, -1], tt) * 3.6
# names(arenosillo) <- c('D0', 'B', 'G0')
# xyplot(arenosillo, superpose=TRUE)

# truncDay <- function(x){as.POSIXct(trunc(x, units='days'))}
# radD <- aggregate(arenosillo, by=truncDay, sum, na.rm=TRUE)/1000 ## kWh
# xyplot(radD, superpose=TRUE)

# ########
# ## AEMET
# ## http://www.tiempodiario.com/rayos/20101205/radiacion_datas.csv
# #######
# #+begin_src R
  
#   URL1 <- "http://www.tiempodiario.com/rayos"
#   URL2 <- "radiacion_datas.csv"
  
#   Y <- 2010
#   m <- 12
#   d <- 5
#   ymd <- as.POSIXct(paste(Y, m, d, sep='-'))
  
#   URL <- paste(URL1, format(ymd, '%Y%m%d'), URL2, sep='/')
#   ## URL <- 'data/radiacion_datas.csv'
  
#   aemetRad <- read.table(URL,
#                    header=FALSE, fill=TRUE, skip=1,
#                    sep=';')
#   nc <- ncol(aemetRad)
#   nms <- aemetRad[1, 2:nc]
  
#   aemetRad <- aemetRad[-1,]
#   Gcols <- 4:19
#   Dcols <- 22:37
#   Bcols <- 40:55
  
  
#   ##estaciones <- aemetRad[,1] ## ¿Encoding?
#   estID <- aemetRad[,2]
#   tt <- seq(ymd + 5*3600, by='hour', length=16)
#   G0 <- zoo(t(aemetRad[,Gcols]), tt) * 3.6 ## kiloJulios -> Wh
#   D0 <- zoo(t(aemetRad[,Dcols]), tt) * 3.6
#   B <- zoo(t(aemetRad[,Bcols]), tt) * 3.6
#   names(G0) <- names(D0) <- names(B) <- estID
  
#   xyplot(G0, superpose=TRUE, auto.key=FALSE)
  
#   G0d <- colSums(G0, na.rm=TRUE)
# #+end_src
