datos.html

<div id="outline-container-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> Mostramos relaciones entre variables</h4>
<div class="outline-text-4" id="text-3-1-4">




<pre class="example">xyplot(Ta ~ G0 + D0 + B0, data=as.data.frame(hawaii), type=c('p', 'smooth'),
       par.settings=custom.theme(alpha=.5, pch=16,
         lwd=3, col.line='black'),
       outer=TRUE, layout=c(3, 1),
       scales=list(x=list(relation='free')))
</pre>


</div>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Datos agregados</h3>
<div class="outline-text-3" id="text-3-2">


</div>

<div id="outline-container-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Irradiación horaria</h4>
<div class="outline-text-4" id="text-3-2-1">

<ul>
<li>Primer intento
</li>
</ul>




<pre class="example">hour &lt;- function(x)as.numeric(format(x, '%H'))
</pre>



<pre class="example">G0h &lt;- aggregate(hawaii$G0, by=hour, FUN=sum, na.rm=1)/1000
G0h
</pre>


</div>

</div>

<div id="outline-container-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> Irradiación horaria</h4>
<div class="outline-text-4" id="text-3-2-2">





<pre class="example">hour &lt;- function(x)as.POSIXct(format(x, '%Y-%m-%d %H:00:00'))
</pre>



<pre class="example">G0h &lt;- aggregate(hawaii$G0, by=hour, FUN=sum, na.rm=1)/60
G0h
</pre>


</div>

</div>

<div id="outline-container-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> Irradiación diaria</h4>
<div class="outline-text-4" id="text-3-2-3">

<ul>
<li>A partir de la horaria
</li>
</ul>




<pre class="example">G0d &lt;- aggregate(G0h, by=function(x)format(x, '%Y-%m-%d'), sum)/1000
</pre>

<ul>
<li>A partir de la minutaria
</li>
</ul>




<pre class="example">G0d &lt;- aggregate(hawaii$G0, by=function(x)format(x, '%Y-%m-%d'), sum)/60/1000
</pre>



</div>

</div>

<div id="outline-container-3-2-4" class="outline-4">
<h4 id="sec-3-2-4"><span class="section-number-4">3.2.4</span> Más complicado: agrupar por 30 minutos</h4>
<div class="outline-text-4" id="text-3-2-4">




<pre class="example">halfHour &lt;- function(tt, delta=30){
  tt &lt;- as.POSIXlt(tt)
  gg &lt;- tt$min %/% delta
  tt &lt;- modifyList(tt, list(min=gg*delta))
  as.POSIXct(tt)
}
</pre>



<pre class="example">hawaii30 &lt;- aggregate(hawaii, by=halfHour, FUN=sum)/60

head(hawaii30)
</pre>














</div>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Fecha: 25 de Enero de 2013</p>
<p class="author">Autor: Oscar Perpiñán Lamigueiro</p>
<p class="creator">Org version 7.8.11 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
