datos.tex
\begin{frame}[fragile]
\frametitle{Mostramos relaciones entre variables}
\label{sec-3-1-4}


\lstset{language=R}
\begin{lstlisting}
xyplot(Ta ~ G0 + D0 + B0, data=as.data.frame(hawaii), type=c('p', 'smooth'),
       par.settings=custom.theme(alpha=.5, pch=16,
         lwd=3, col.line='black'),
       outer=TRUE, layout=c(3, 1),
       scales=list(x=list(relation='free')))
\end{lstlisting}
\end{frame}
\subsection{Datos agregados}
\label{sec-3-2}
\begin{frame}[fragile]
\frametitle{Irradiación horaria}
\label{sec-3-2-1}

\begin{itemize}
\item Primer intento
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
hour <- function(x)as.numeric(format(x, '%H'))
\end{lstlisting}


\lstset{language=R}
\begin{lstlisting}
G0h <- aggregate(hawaii$G0, by=hour, FUN=sum, na.rm=1)/1000
G0h
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Irradiación horaria}
\label{sec-3-2-2}



\lstset{language=R}
\begin{lstlisting}
hour <- function(x)as.POSIXct(format(x, '%Y-%m-%d %H:00:00'))
\end{lstlisting}


\lstset{language=R}
\begin{lstlisting}
G0h <- aggregate(hawaii$G0, by=hour, FUN=sum, na.rm=1)/60
G0h
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Irradiación diaria}
\label{sec-3-2-3}

\begin{itemize}
\item A partir de la horaria
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
G0d <- aggregate(G0h, by=function(x)format(x, '%Y-%m-%d'), sum)/1000
\end{lstlisting}
\begin{itemize}
\item A partir de la minutaria
\end{itemize}

\lstset{language=R}
\begin{lstlisting}
G0d <- aggregate(hawaii$G0, by=function(x)format(x, '%Y-%m-%d'), sum)/60/1000
\end{lstlisting}
\end{frame}
\begin{frame}[fragile]
\frametitle{Más complicado: agrupar por 30 minutos}
\label{sec-3-2-4}


\lstset{language=R}
\begin{lstlisting}
halfHour <- function(tt, delta=30){
  tt <- as.POSIXlt(tt)
  gg <- tt$min %/% delta
  tt <- modifyList(tt, list(min=gg*delta))
  as.POSIXct(tt)
}
\end{lstlisting}


\lstset{language=R}
\begin{lstlisting}
hawaii30 <- aggregate(hawaii, by=halfHour, FUN=sum)/60

head(hawaii30)
\end{lstlisting}




  
  
  
  
  
  
  
  
  
\end{frame}

\end{document}